#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//
//int main()
//{
//	int a = 10;//4
//	float b = 10.0;//4
//
//	short a = 10;
//	short int b = 10;
//
//
//
//	return 0;
//}
//
//void test(void)
//{
//	printf("hehe\n");
//}
//
//int main()
//{
//	test(100);
//	return 0;
//}

//int main()
//{
//	int a = 20;//四个字节
//	//000000000000000000000000000010100  -原码
//	//000000000000000000000000000010100  -反码
//	//000000000000000000000000000010100  -补码
//	//0x00000014
//	//
//	int b = -10;
//	//100000000000000000000000000001010  -原码
//	//111111111111111111111111111110101  -反码
//	//1111 1111 1111 1111 1111 1111 1111 0110  -补码
//	//FFFFFFF6
//
//	return 0;
//}


//int main()
//{
//	1 - 1；
//
//		//1+(-1)  补码进行计算
//		//00000000000000000000000000000001
//		// 1111111111111111111111111111110
//		// 1111111111111111111111111111111
//		// 10000000000000000000000000000000
//		// 0000000000000000000000000000000
//		// 
//		// 
// 
//		//00000000000000000000000000000001
//		//10000000000000000000000000000001
//		//10000000000000000000000000000010
//	return 0;
//}

//int main()
//{
//	int a = 20;//在计算机存储的过程中是倒着存储的
//	//000000000000000000000000000010100
//	//00 00 00 14
//
//	return 0;
//}

//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	int a = 1;
//	char* p = (char*)&a;//强制类型转换
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//		return 1;
//	else
//		return 0;
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//
//	//返回1，小端
//	//返回0，大端
//	return *p;
//}

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
////指针类型的定义
////1、指针类型决定了指针解引用操作符能够访问几个字节：char* p;*p访问了一个字节，int* p,*p访问了4个字节
////2、指针类型决定了指针+1，-1加的或者减的是几个字节：char* p;p+1,跳过一个字符，int* p;p+1,跳过了一个整形及4个字节
//
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int main()
//{
//	int a = 0x11223344;
//	int* p = &a;
//	*p = 0;
//	/*char* p = &a;
//	*p = 0;*/
//	return 0;
//}


//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111                               整形提升
//	//11111111111111111111111111111111  反码
//
//	signed char b = -1;
//	//11111111
//
//	unsigned char c = -1;
//	//11111111								整形提升
//	//00000000000000000000000011111111
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}


//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000  原码
//	//11111111111111111111111101111111  反码
//	//11111111111111111111111110000000	补码
//	//10000000
//	//11111111111111111111111110000000	整形提升
//	printf("%u\n", a);
//	//%d- 打印十进制的有符号数字
//	//%u- 打印十进制的无符号数字
//	return 0;
//}
////有符号char的范围-128到127
////无符号char的范围0-255
